In [2]:
import numpy as np
import pandas as pd

In [3]:
# nan - мы не знаем что это за значение
np.nan

nan

In [5]:
# новое обозначение для отсутствующих значений
pd.NA

In [7]:
# NaT - not a timestamp
pd.NaT

NaT

In [8]:
# поскольку мы не знаем чему равно nan -> будет False
np.nan == np.nan

False

In [10]:
# проверяем является ли значение неизвестным
np.nan is np.nan

True

In [11]:
df = pd.read_csv('../course_data/03-Pandas/movie_scores.csv')
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [13]:
# проверяем содержит ли dataframe отсутствующие данные
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False